In [1]:
import numpy as np
import pandas as pd

from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

import seaborn as sns

c:\Users\SUNIL\anaconda3\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
df = pd.read_csv('train.csv', usecols=['Age', 'Pclass', 'SibSp', 'Parch', 'Survived'])

In [3]:
df.head()

   Survived  Pclass   Age  SibSp  Parch
0         0       3  22.0      1      0
1         1       1  38.0      1      0
2         1       3  26.0      0      0
3         1       1  35.0      1      0
4         0       3  35.0      0      0

In [4]:
df.dropna(inplace=True)

In [5]:
X = df.drop(['Survived'], axis=1)
y = df['Survived']

In [7]:
np.mean(cross_val_score(LogisticRegression(), X, y, cv=10, scoring='accuracy'))

0.6921165884194054

### Applying feature construction

In [8]:
df['family'] = df['Parch'] + df['SibSp'] + 1

In [24]:
def myfunc(num):
    if num == 1:
        return 0
    if num == 2:
        return 1
    if (num > 2) and (num <= 4):
        return 2
    else:
        return 3

In [29]:
myfunc(3)

2

In [31]:
df['family_type'] = df['family'].apply(myfunc)

In [32]:
X = df.drop(['Survived'], axis=1)
y = df['Survived']

In [33]:
X.head()

   Pclass   Age  SibSp  Parch  family  family_type
0       3  22.0      1      0       2            1
1       1  38.0      1      0       2            1
2       3  26.0      0      0       1            0
3       1  35.0      1      0       2            1
4       3  35.0      0      0       1            0

In [34]:
X.drop(['SibSp', 'Parch', 'family'], axis=1, inplace=True)

In [35]:
X.head()

   Pclass   Age  family_type
0       3  22.0            1
1       1  38.0            1
2       3  26.0            0
3       1  35.0            1
4       3  35.0            0

In [38]:
df.corr()['Survived']

Survived       1.000000
Pclass        -0.359653
Age           -0.077221
SibSp         -0.017358
Parch          0.093317
family         0.042787
family_type    0.110684
Name: Survived, dtype: float64

In [36]:
np.mean(cross_val_score(LogisticRegression(), X, y, cv=10, scoring='accuracy'))

0.6991392801251957

### feature splitting

In [39]:
df = pd.read_csv('train.csv')

In [40]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [93]:
df['Title'] = df['Name'].str.split(', ').str[-1].str.split().str[0]

In [95]:
df['Surname'] = df['Name'].str.split(', ').str[0]

In [92]:
df['Name'].str.split(', ')

0                              [Braund, Mr. Owen Harris]
1      [Cumings, Mrs. John Bradley (Florence Briggs T...
2                               [Heikkinen, Miss. Laina]
3         [Futrelle, Mrs. Jacques Heath (Lily May Peel)]
4                             [Allen, Mr. William Henry]
                             ...
886                              [Montvila, Rev. Juozas]
887                       [Graham, Miss. Margaret Edith]
888           [Johnston, Miss. Catherine Helen "Carrie"]
889                              [Behr, Mr. Karl Howell]
890                                [Dooley, Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [96]:
df[['Survived', 'Title', 'Surname']].groupby(['Title', 'Surname']).mean()

                       Survived
Title Surname
Capt. Crosby                0.0
Col.  Simonius-Blumer       1.0
      Weir                  0.0
Don.  Uruchurtu             0.0
Dr.   Brewe                 0.0
...                         ...
Rev.  Harper                0.0
      Kirkland              0.0
      Montvila              0.0
Sir.  Duff Gordon           1.0
the   Rothes                1.0

[803 rows x 1 columns]